# How to Join and Append DataFrames:-

In [1]:
import pandas as pd

In [11]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var2 = pd.DataFrame({"C":[9,10,11,12],"D":[13,14,15,16]})

In [12]:
var3= var1.join(var2)

In [13]:
var3

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [14]:
var4 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]},index=["a","b","c","d"])
var5 = pd.DataFrame({"C":[9,10,11,12],"D":[13,14,15,16]},index=["a","b","c","d"])

In [15]:
var6 = var4.join(var5)

In [16]:
var6

   A  B   C   D
a  1  5   9  13
b  2  6  10  14
c  3  7  11  15
d  4  8  12  16

In [17]:
var7 = var2.join(var1)

In [18]:
var7

    C   D  A  B
0   9  13  1  5
1  10  14  2  6
2  11  15  3  7
3  12  16  4  8

In [22]:
var9= pd.DataFrame({"A":[1,2,3,4],"B":[11,12,13,14]},index =["a","b","c","d"])
var10 = pd.DataFrame({"C":[10,20],"D":[11,22]},index =["a","b"])

In [23]:
var11 = var9.join(var10,how="left")

In [24]:
var11

   A   B     C     D
a  1  11  10.0  11.0
b  2  12  20.0  22.0
c  3  13   NaN   NaN
d  4  14   NaN   NaN

In [25]:
var12 = var9.join(var10,how="right")

In [26]:
var12

   A   B   C   D
a  1  11  10  11
b  2  12  20  22

In [19]:
var8 = var2.join(var1,how="left")

In [20]:
var8

    C   D  A  B
0   9  13  1  5
1  10  14  2  6
2  11  15  3  7
3  12  16  4  8

In [27]:
var13 = var9.join(var10,how="outer")

In [28]:
var13

   A   B     C     D
a  1  11  10.0  11.0
b  2  12  20.0  22.0
c  3  13   NaN   NaN
d  4  14   NaN   NaN

In [29]:
var14 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var15 = pd.DataFrame({"A":[9,10,11,12],"C":[13,14,15,16]})

In [30]:
var16 = var15.join(var14,how="outer",lsuffix="_12")

In [31]:
var16

   A_12   C  A  B
0     9  13  1  5
1    10  14  2  6
2    11  15  3  7
3    12  16  4  8

In [39]:
var17 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var18 = pd.DataFrame({"D":[1,2,3,4],"C":[13,14,15,16]})

In [40]:
var19 = var17.join(var18,how="inner")

In [41]:
var19

   A  B  D   C
0  1  5  1  13
1  2  6  2  14
2  3  7  3  15
3  4  8  4  16

In [42]:
var20 = var15.join(var14,how="outer",lsuffix="_12",rsuffix="_12")

In [43]:
var20

   A_12   C  A_12  B
0     9  13     1  5
1    10  14     2  6
2    11  15     3  7
3    12  16     4  8

# How work append function:-

In [17]:
var21 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]},index=["a","b","c","d"])
var22 = pd.DataFrame({"C":[10,20],"B":[11,22]},index=["a","b"])

In [8]:
var23 = var21.append(var22)

C:\Users\vishal\AppData\Local\Temp\ipykernel_16840\183652886.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  var23 = var21.append(var22)

In [9]:
var23

     A    B     C     D
a  1.0  5.0   NaN   NaN
b  2.0  6.0   NaN   NaN
c  3.0  7.0   NaN   NaN
d  4.0  8.0   NaN   NaN
a  NaN  NaN  10.0  11.0
b  NaN  NaN  20.0  22.0

In [22]:
var24 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var25 = pd.DataFrame({"C":[10,20],"B":[11,22]})

In [23]:
var26 = var24.append(var25)

C:\Users\vishal\AppData\Local\Temp\ipykernel_16840\317494224.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  var26 = var24.append(var25)

In [24]:
var26

     A   B     C
0  1.0   5   NaN
1  2.0   6   NaN
2  3.0   7   NaN
3  4.0   8   NaN
0  NaN  11  10.0
1  NaN  22  20.0

In [27]:
var24.append(var25,ignore_index=True)

C:\Users\vishal\AppData\Local\Temp\ipykernel_16840\184279394.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  var24.append(var25,ignore_index=True)

     A   B     C
0  1.0   5   NaN
1  2.0   6   NaN
2  3.0   7   NaN
3  4.0   8   NaN
4  NaN  11  10.0
5  NaN  22  20.0